;(function(window, undefined){
    "use strict";
    var $ = window.jQuery;
    // ztree
    var zTreeObj;
   // zTree 的参数配置，深入使用请参考 API 文档（setting 配置详解）
   var setting = {
     view: {
                showLine:false, //不显示连接线
                showIcon:false //不显示图标
            },
     data:{
              simpleData:{
                  enable:true
              }
          },
          check: {
              enable: true,
              nocheckInherit: false,
              chkboxType : { "Y" : "ps", "N" : "ps" }
          }
     };
   // zTree 的数据属性，深入使用请参考 API 文档（zTreeNode 节点数据详解）
   var zNodes=[
					{id:"1", pId:"0", name:"功能菜单"},
          {id:"20170223125651499418", pId:"20170223125502115352", name:"规则配置"},
          {id:"20170223125704883585", pId:"20170223125502115352", name:"优先级调整"},
          {id:"20170223125717146967", pId:"20170223125502115352", name:"撤销撮合"},
          {id:"82", pId:"80", name:"业务表配置"},
          {id:"11", pId:"10", name:"查看"},
          {id:"15", pId:"14", name:"查看"},
          {id:"18", pId:"17", name:"查看"},
          {id:"20", pId:"13", name:"用户管理"},
          {id:"21", pId:"20", name:"查看"},
          {id:"20170223162426343590", pId:"20170223151425318194", name:"合同列表"},
          {id:"28", pId:"27", name:"个人信息"},
          {id:"29", pId:"28", name:"个人信息"},
          {id:"20170224105143320113", pId:"20170223125651499418", name:"增"},
          {id:"20170224110403599361", pId:"20170223162907882552", name:"计划列表"},
          {id:"20170224114105165897", pId:"20170223162907882552", name:"编辑"},
          {id:"4", pId:"3", name:"菜单管理"},
          {id:"20170224162212219388", pId:"20170223162426343590", name:"签章明细"},
          {id:"4855cf3b25c244fb8500a380db189d97", pId:"b1f6d1b86ba24365bae7fd86c5082317", name:"查看"},
          {id:"5", pId:"4", name:"查看"},
          {id:"20170223171400527471", pId:"20170223171137268519", name:"机构列表"},
          {id:"68", pId:"67", name:"日志查询"},
          {id:"8", pId:"7", name:"查看"},
          {id:"81", pId:"80", name:"生成方案配置"},
          {id:"ba8092291b40482db8fe7fc006ea3d76", pId:"3c92c17886944d0687e73e286cada573", name:"单表"},
          {id:"c2e4d9082a0b4386884a0b203afe2c5c", pId:"0ca004d6b1bf4bcab9670a5060d82a55", name:"查看"},
          {id:"df7ce823c5b24ff9bada43d992f373e2", pId:"ba8092291b40482db8fe7fc006ea3d76", name:"查看"},
          {id:"20170224162900545383", pId:"20170224162845132772", name:"签章统计报表"},
          {id:"12", pId:"10", name:"修改"},
          {id:"16", pId:"14", name:"修改"},
          {id:"17", pId:"13", name:"机构管理"},
          {id:"19", pId:"17", name:"修改"},
          {id:"22", pId:"20", name:"修改"},
          {id:"30", pId:"28", name:"修改密码"},
          {id:"6", pId:"4", name:"修改"},
          {id:"84", pId:"67", name:"连接池监视"},
          {id:"9", pId:"7", name:"修改"},
          {id:"14", pId:"13", name:"区域管理"},
          {id:"7", pId:"3", name:"角色管理"},
          {id:"80", pId:"79", name:"代码生成"},
          {id:"0b2ebd4d639e4c2b83c2dd0764522f24", pId:"ba8092291b40482db8fe7fc006ea3d76", name:"编辑"},
          {id:"10", pId:"3", name:"字典管理"},
          {id:"20170224102819618375", pId:"20170223171137268519", name:"编辑"},
          {id:"20170224162110051720", pId:"20170223151425318194", name:"合同确认"},
          {id:"20170224162337094991", pId:"20170223162426343590", name:"计划还款明细"},
          {id:"afab2db430e2457f9cf3a11feaa8b869", pId:"0ca004d6b1bf4bcab9670a5060d82a55", name:"编辑"},
          {id:"b1f6d1b86ba24365bae7fd86c5082317", pId:"3c92c17886944d0687e73e286cada573", name:"主子表"},
          {id:"d15ec45a4c5449c3bbd7a61d5f9dd1d2", pId:"b1f6d1b86ba24365bae7fd86c5082317", name:"编辑"},
          {id:"20170224162914325152", pId:"20170224162845132772", name:"放款明细报表"},
          {id:"0ca004d6b1bf4bcab9670a5060d82a55", pId:"3c92c17886944d0687e73e286cada573", name:"树结构"},
          {id:"20170224162628640249", pId:"20170223162426343590", name:"详细信息"},
          {id:"20170227171049317390", pId:"20170223171137268519", name:"详细信息"},
          {id:"27", pId:"1", name:"我的面板"},
          {id:"3c92c17886944d0687e73e286cada573", pId:"79", name:"生成示例"},
          {id:"20170227173341796137", pId:"20170223171137268519", name:"统计信息"},
          {id:"20170227180427518077", pId:"20170223171137268519", name:"资料权限配置"},
          {id:"20170223171137268519", pId:"20170223170729614650", name:"机构管理"},
          {id:"2", pId:"1", name:"系统管理"},
          {id:"13", pId:"2", name:"机构用户"},
          {id:"3", pId:"2", name:"系统设置"},
          {id:"67", pId:"2", name:"日志查询"},
          {id:"79", pId:"1", name:"代码生成"},
          {id:"20170223125502115352", pId:"20170223170729614650", name:"撮合管理"},
          {id:"20170223151425318194", pId:"20170223170729614650", name:"合同管理"},
          {id:"20170223162907882552", pId:"20170223170729614650", name:"计划管理"},
          {id:"20170223170729614650", pId:"1", name:"业务管理"},
          {id:"20170224162845132772", pId:"20170223170729614650", name:"报表管理"},
          ];

     $(document).ready(function(){
        var zTreeObj = $.fn.zTree.init($("#treeDemo"), setting, zNodes);
        // 默认展开全部节点
			  zTreeObj.expandAll(true);
     });
  })(window);
